Workspace/test_cases/sineWaveDampingPimpleFoam3Dduct-rotatingWave/0_org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    inlet
    {
        type            zeroGradient; // oscillatingFixedValue;
    }

    outlet
    {
        type            waveTransmision;
        gamma           1.4;
        fieldInf        101325;
        lInf            10;
        value           $internalField;
    }
    body 
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
